[default]
disabled = 0

[Events Per Hour]
action.email.useNSSubject = 1
alert.track = 0
dispatch.earliest_time = 0
display.general.type = visualizations
display.page.search.tab = visualizations
display.visualizations.chartHeight = 378
display.visualizations.charting.axisY.scale = log
display.visualizations.charting.chart = line
display.visualizations.charting.legend.labelStyle.overflowMode = ellipsisStart
request.ui_dispatch_app = cowrie
request.ui_dispatch_view = search
search = index=cowrie | timechart span=1h count AS Events | eval Time = strftime(_time, "%Y-%d-%m %H:%M:%S") | fields - _time | table Time Events

[Unique Source IP Count]
action.email.useNSSubject = 1
alert.track = 0
dispatch.earliest_time = 0
display.general.type = visualizations
display.page.search.tab = visualizations
display.statistics.show = 0
display.visualizations.chartHeight = 378
display.visualizations.charting.chart = radialGauge
display.visualizations.charting.legend.labelStyle.overflowMode = ellipsisStart
request.ui_dispatch_app = cowrie
request.ui_dispatch_view = search
search = index=cowrie src_ip=* | stats dc(src_ip)

[Top Countries of Origin]
action.email.useNSSubject = 1
alert.track = 0
dispatch.earliest_time = 0
display.general.type = statistics
display.page.search.tab = statistics
display.visualizations.chartHeight = 378
display.visualizations.charting.chart = bar
display.visualizations.charting.legend.labelStyle.overflowMode = ellipsisStart
display.visualizations.show = 0
display.visualizations.type = mapping
request.ui_dispatch_app = cowrie
request.ui_dispatch_view = search
search = index=cowrie | iplocation src_ip | stats count BY Country | sort 0 - count | fields Country, count | rename count AS Events | head 10

[Attack Source Geolocation Map]
action.email.useNSSubject = 1
alert.track = 0
dispatch.earliest_time = 0
display.general.type = visualizations
display.page.search.tab = visualizations
display.statistics.show = 0
display.visualizations.chartHeight = 378
display.visualizations.charting.chart = bar
display.visualizations.charting.legend.labelStyle.overflowMode = ellipsisStart
display.visualizations.type = mapping
request.ui_dispatch_app = cowrie
request.ui_dispatch_view = search
search = index=cowrie | iplocation src_ip | geostats count BY Country

[Attack Source Protocol]
action.email.useNSSubject = 1
alert.track = 0
dispatch.earliest_time = 0
display.general.type = statistics
display.page.search.tab = statistics
display.visualizations.chartHeight = 378
display.visualizations.charting.chart = bar
display.visualizations.charting.legend.labelStyle.overflowMode = ellipsisStart
display.visualizations.show = 0
display.visualizations.type = mapping
request.ui_dispatch_app = cowrie
request.ui_dispatch_view = search
search = index=cowrie protocol=* | stats count BY protocol | sort - Events | rename protocol AS Protocol, count AS Events

[Top Usernames]
action.email.useNSSubject = 1
alert.track = 0
dispatch.earliest_time = 0
display.general.type = statistics
display.page.search.tab = statistics
display.visualizations.chartHeight = 378
display.visualizations.charting.chart = bar
display.visualizations.charting.legend.labelStyle.overflowMode = ellipsisStart
display.visualizations.show = 0
display.visualizations.type = mapping
request.ui_dispatch_app = cowrie
request.ui_dispatch_view = search
search = index=cowrie username=* | stats count BY username | sort - count | rename username AS Username, count AS Events | head 100

[Top Passwords]
action.email.useNSSubject = 1
alert.track = 0
dispatch.earliest_time = 0
display.general.type = statistics
display.page.search.tab = statistics
display.visualizations.chartHeight = 378
display.visualizations.charting.chart = bar
display.visualizations.charting.legend.labelStyle.overflowMode = ellipsisStart
display.visualizations.show = 0
display.visualizations.type = mapping
request.ui_dispatch_app = cowrie
request.ui_dispatch_view = search
search = index=cowrie password=* | stats count BY password | sort - count | rename password AS Password, count AS Count | head 100

[Top Username Password Combos]
action.email.useNSSubject = 1
alert.track = 0
dispatch.earliest_time = 0
display.general.type = statistics
display.page.search.tab = statistics
display.visualizations.chartHeight = 378
display.visualizations.charting.chart = bar
display.visualizations.charting.legend.labelStyle.overflowMode = ellipsisStart
display.visualizations.show = 0
display.visualizations.type = mapping
request.ui_dispatch_app = cowrie
request.ui_dispatch_view = search
search = index=cowrie username=* | stats count BY username, password | sort 0 - count | rename username AS Username, password AS Password, count AS Count | head 100

[Top Source IP Addresses]
action.email.useNSSubject = 1
alert.track = 0
dispatch.earliest_time = 0
display.general.type = statistics
display.page.search.tab = statistics
display.visualizations.chartHeight = 378
display.visualizations.charting.chart = bar
display.visualizations.charting.legend.labelStyle.overflowMode = ellipsisStart
display.visualizations.show = 0
display.visualizations.type = mapping
request.ui_dispatch_app = cowrie
request.ui_dispatch_view = search
search = index=cowrie | stats count BY src_ip | sort 0 - count | iplocation src_ip | fields src_ip, Country, Region, City, count | rename src_ip AS "Source IP", count AS Events | head 10

[Top Source Ports]
action.email.useNSSubject = 1
alert.track = 0
dispatch.earliest_time = 0
display.general.type = statistics
display.page.search.tab = statistics
display.visualizations.chartHeight = 378
display.visualizations.charting.chart = bar
display.visualizations.charting.legend.labelStyle.overflowMode = ellipsisStart
display.visualizations.show = 0
display.visualizations.type = mapping
request.ui_dispatch_app = cowrie
request.ui_dispatch_view = search
search = index=cowrie src_port=* | stats count BY src_port | sort - count | rename src_port AS "Source Port", count AS Events | head 10

[Top Destination IP Addresses]
action.email.useNSSubject = 1
alert.track = 0
dispatch.earliest_time = 0
display.general.type = statistics
display.page.search.tab = statistics
display.visualizations.chartHeight = 378
display.visualizations.charting.chart = bar
display.visualizations.charting.legend.labelStyle.overflowMode = ellipsisStart
display.visualizations.show = 0
display.visualizations.type = mapping
request.ui_dispatch_app = cowrie
request.ui_dispatch_view = search
search = index=cowrie dst_ip=* | stats count BY dst_ip | sort - count | fields dst_ip, count | rename dst_ip AS "Destination IP", count AS Events | head 10

[Top Destination Ports]
action.email.useNSSubject = 1
alert.track = 0
dispatch.earliest_time = 0
display.general.type = statistics
display.page.search.tab = statistics
display.visualizations.chartHeight = 378
display.visualizations.charting.chart = bar
display.visualizations.charting.legend.labelStyle.overflowMode = ellipsisStart
display.visualizations.show = 0
display.visualizations.type = mapping
request.ui_dispatch_app = cowrie
request.ui_dispatch_view = search
search = index=cowrie dst_port=* | stats count BY dst_port, dst_port_description | sort 0 - count | rename dst_port AS "Destination Port", dst_port_description AS Description, count AS Events| head 10

[Top File URL's]
action.email.useNSSubject = 1
alert.track = 0
dispatch.earliest_time = 0
display.general.type = statistics
display.page.search.tab = statistics
display.visualizations.chartHeight = 378
display.visualizations.charting.chart = bar
display.visualizations.charting.legend.labelStyle.overflowMode = ellipsisStart
display.visualizations.show = 0
display.visualizations.type = mapping
request.ui_dispatch_app = cowrie
request.ui_dispatch_view = search
search = index=cowrie eventid="cowrie.session.file_download" url=* | stats count BY url, shasum | sort 0 - count | rename url AS URL, shasum AS SHA, count AS Downloads | head 10

[Top File Downloads]
action.email.useNSSubject = 1
alert.track = 0
dispatch.earliest_time = 0
display.general.type = statistics
display.page.search.tab = statistics
display.visualizations.chartHeight = 378
display.visualizations.charting.chart = bar
display.visualizations.charting.legend.labelStyle.overflowMode = ellipsisStart
display.visualizations.show = 0
display.visualizations.type = mapping
request.ui_dispatch_app = cowrie
request.ui_dispatch_view = search
search = index=cowrie eventid="cowrie.session.file_download" destfile=* destfile!="" | stats count BY destfile, shasum | sort 0 - count | rename destfile AS File, shasum AS SHA, count AS Downloads | head 10

[Top SSH Commands]
action.email.useNSSubject = 1
alert.track = 0
dispatch.earliest_time = 0
display.general.type = statistics
display.page.search.tab = statistics
display.visualizations.chartHeight = 378
display.visualizations.charting.chart = bar
display.visualizations.charting.legend.labelStyle.overflowMode = ellipsisStart
display.visualizations.show = 0
display.visualizations.type = mapping
request.ui_dispatch_app = cowrie
request.ui_dispatch_view = search
search = index=cowrie eventid="cowrie.command.input" | stats count BY input | sort 0 - count | rename input AS Input, count AS Events | head 10
